goofyshwetank/esp32-tailscale-wol/examples/wake_on_lan/sdkconfig.defaults
# MicroLink v2 - ESP32-WROOM-32 sdkconfig defaults (No PSRAM)
# Target
CONFIG_IDF_TARGET="esp32"

# PSRAM (disabled for standard ESP32)
CONFIG_SPIRAM=n

# lwIP (WireGuard needs raw sockets, memory-tuned for no PSRAM)
CONFIG_LWIP_MAX_SOCKETS=12
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=8192
CONFIG_LWIP_TCP_WND_DEFAULT=8192

# mbedTLS (Noise protocol needs ChaCha20-Poly1305)
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_HKDF_C=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# WiFi — low-latency tuning for WireGuard traffic
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

# CPU frequency (240MHz for crypto performance)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Watchdog (extended for TLS handshakes)
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Partition table (use single app large to fit Tailscale app)
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Tailscale / MicroLink Optimizations for low-RAM (No PSRAM)
CONFIG_ML_MAX_PEERS=8
CONFIG_ML_H2_BUFFER_SIZE_KB=32
CONFIG_ML_JSON_BUFFER_SIZE_KB=32

# HTTP Config Server (disabled to conserve SRAM)
CONFIG_ML_ENABLE_CONFIG_HTTPD=n
